tutorials/multicomponentFluid/verticalChannel/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-9;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    inletCentral
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 3.75e-9;
    }
    inletSides
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 3.75e-9;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-9;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
